; domain
(define (domain joint_teleport-assistance6_domain)
(:requirements :typing :action-costs)

(:types
    place telstatus - object
)

(:constants
    origin destination disabled - telstatus
)

(:predicates
    (prime_turn)
    (supporter_turn)
    (at-prime ?p -  place)
    (at-teleport ?p - place ?s -  telstatus)
    (teleport_origin_can_be_activated)
    (teleport_destination_can_be_activated)
    (adj-walk ?p1 - place ?p2 -  place)
)

(:functions
    (total-cost) - number
)

(:action sup_activate-teleport-origin
    :parameters (?pos - place)
    :precondition (and
        (supporter_turn)
        (teleport_origin_can_be_activated)
        (at-teleport ?pos disabled)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-teleport ?pos origin)
        (not (teleport_origin_can_be_activated))
        (not (at-teleport ?pos disabled))
        (increase (total-cost) 1.0)
    )
)

(:action sup_activate-teleport-destination
    :parameters (?pos - place)
    :precondition (and
        (supporter_turn)
        (teleport_destination_can_be_activated)
        (at-teleport ?pos disabled)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-teleport ?pos destination)
        (not (teleport_destination_can_be_activated))
        (not (at-teleport ?pos disabled))
        (increase (total-cost) 1.0)
    )
)

(:action sup_use-teleport
    :parameters (?pos1 ?pos2 - place)
    :precondition (and
        (supporter_turn)
        (at-prime ?pos1)
        (at-teleport ?pos1 origin)
        (at-teleport ?pos2 destination)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-prime ?pos2)
        (not (at-prime ?pos1))
        (increase (total-cost) 1.0)
    )
)

(:action pri_walk
    :parameters (?from - place ?to - place)
    :precondition (and
        (prime_turn)
        (adj-walk ?from ?to)
        (at-prime ?from)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (at-prime ?to)
        (not (at-prime ?from))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_noop
    :parameters ()
    :precondition (and
        (prime_turn)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (increase (total-cost) 0)
    )
)

(:action sup_noop
    :parameters ()
    :precondition (and
        (supporter_turn)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (increase (total-cost) 0)
    )
)

)

; problem
(define (problem joint_teleport-assistance6_problem_186)
(:domain joint_teleport-assistance6_domain)
(:objects
    pos0-1 pos0-2 pos0-4 pos0-5 pos0-7 pos0-8 pos0-9 pos1-0 pos1-1 pos1-3 pos1-4 pos1-5 pos1-6 pos1-7 pos1-8 pos2-0 pos2-1 pos2-2 pos2-3 pos2-4 pos2-5 pos2-6 pos2-7 pos2-8 pos2-9 pos3-0 pos3-1 pos3-2 pos3-3 pos3-4 pos3-5 pos3-6 pos3-7 pos4-1 pos4-2 pos4-3 pos4-5 pos4-7 pos4-8 pos4-9 - place
)

(:init
    (= (total-cost) 0)
    (supporter_turn)
    (at-teleport pos3-6 disabled)
    (at-teleport pos2-7 disabled)
    (at-teleport pos2-8 disabled)
    (at-teleport pos2-3 disabled)
    (at-teleport pos0-1 disabled)
    (teleport_origin_can_be_activated)
    (teleport_destination_can_be_activated)
    (at-prime pos0-1)
    (adj-walk pos0-1 pos0-2)
    (adj-walk pos0-2 pos0-1)
    (adj-walk pos0-1 pos1-1)
    (adj-walk pos1-1 pos0-1)
    (adj-walk pos0-4 pos0-5)
    (adj-walk pos0-5 pos0-4)
    (adj-walk pos0-4 pos1-4)
    (adj-walk pos1-4 pos0-4)
    (adj-walk pos0-5 pos1-5)
    (adj-walk pos1-5 pos0-5)
    (adj-walk pos0-7 pos0-8)
    (adj-walk pos0-8 pos0-7)
    (adj-walk pos0-7 pos1-7)
    (adj-walk pos1-7 pos0-7)
    (adj-walk pos0-8 pos0-9)
    (adj-walk pos0-9 pos0-8)
    (adj-walk pos0-8 pos1-8)
    (adj-walk pos1-8 pos0-8)
    (adj-walk pos1-0 pos1-1)
    (adj-walk pos1-1 pos1-0)
    (adj-walk pos1-0 pos2-0)
    (adj-walk pos2-0 pos1-0)
    (adj-walk pos1-1 pos2-1)
    (adj-walk pos2-1 pos1-1)
    (adj-walk pos1-3 pos1-4)
    (adj-walk pos1-4 pos1-3)
    (adj-walk pos1-3 pos2-3)
    (adj-walk pos2-3 pos1-3)
    (adj-walk pos1-4 pos1-5)
    (adj-walk pos1-5 pos1-4)
    (adj-walk pos1-4 pos2-4)
    (adj-walk pos2-4 pos1-4)
    (adj-walk pos1-5 pos1-6)
    (adj-walk pos1-6 pos1-5)
    (adj-walk pos1-5 pos2-5)
    (adj-walk pos2-5 pos1-5)
    (adj-walk pos1-6 pos1-7)
    (adj-walk pos1-7 pos1-6)
    (adj-walk pos1-6 pos2-6)
    (adj-walk pos2-6 pos1-6)
    (adj-walk pos1-7 pos1-8)
    (adj-walk pos1-8 pos1-7)
    (adj-walk pos1-7 pos2-7)
    (adj-walk pos2-7 pos1-7)
    (adj-walk pos1-8 pos2-8)
    (adj-walk pos2-8 pos1-8)
    (adj-walk pos2-0 pos2-1)
    (adj-walk pos2-1 pos2-0)
    (adj-walk pos2-0 pos3-0)
    (adj-walk pos3-0 pos2-0)
    (adj-walk pos2-1 pos2-2)
    (adj-walk pos2-2 pos2-1)
    (adj-walk pos2-1 pos3-1)
    (adj-walk pos3-1 pos2-1)
    (adj-walk pos2-2 pos2-3)
    (adj-walk pos2-3 pos2-2)
    (adj-walk pos2-2 pos3-2)
    (adj-walk pos3-2 pos2-2)
    (adj-walk pos2-3 pos2-4)
    (adj-walk pos2-4 pos2-3)
    (adj-walk pos2-3 pos3-3)
    (adj-walk pos3-3 pos2-3)
    (adj-walk pos2-4 pos2-5)
    (adj-walk pos2-5 pos2-4)
    (adj-walk pos2-4 pos3-4)
    (adj-walk pos3-4 pos2-4)
    (adj-walk pos2-5 pos2-6)
    (adj-walk pos2-6 pos2-5)
    (adj-walk pos2-5 pos3-5)
    (adj-walk pos3-5 pos2-5)
    (adj-walk pos2-6 pos2-7)
    (adj-walk pos2-7 pos2-6)
    (adj-walk pos2-6 pos3-6)
    (adj-walk pos3-6 pos2-6)
    (adj-walk pos2-7 pos2-8)
    (adj-walk pos2-8 pos2-7)
    (adj-walk pos2-7 pos3-7)
    (adj-walk pos3-7 pos2-7)
    (adj-walk pos2-8 pos2-9)
    (adj-walk pos2-9 pos2-8)
    (adj-walk pos3-0 pos3-1)
    (adj-walk pos3-1 pos3-0)
    (adj-walk pos3-1 pos3-2)
    (adj-walk pos3-2 pos3-1)
    (adj-walk pos3-1 pos4-1)
    (adj-walk pos4-1 pos3-1)
    (adj-walk pos3-2 pos3-3)
    (adj-walk pos3-3 pos3-2)
    (adj-walk pos3-2 pos4-2)
    (adj-walk pos4-2 pos3-2)
    (adj-walk pos3-3 pos3-4)
    (adj-walk pos3-4 pos3-3)
    (adj-walk pos3-3 pos4-3)
    (adj-walk pos4-3 pos3-3)
    (adj-walk pos3-4 pos3-5)
    (adj-walk pos3-5 pos3-4)
    (adj-walk pos3-5 pos3-6)
    (adj-walk pos3-6 pos3-5)
    (adj-walk pos3-5 pos4-5)
    (adj-walk pos4-5 pos3-5)
    (adj-walk pos3-6 pos3-7)
    (adj-walk pos3-7 pos3-6)
    (adj-walk pos3-7 pos4-7)
    (adj-walk pos4-7 pos3-7)
    (adj-walk pos4-1 pos4-2)
    (adj-walk pos4-2 pos4-1)
    (adj-walk pos4-2 pos4-3)
    (adj-walk pos4-3 pos4-2)
    (adj-walk pos4-7 pos4-8)
    (adj-walk pos4-8 pos4-7)
    (adj-walk pos4-8 pos4-9)
    (adj-walk pos4-9 pos4-8)
)

(:goal
  (and
    (at-prime pos1-7)
  )
)
(:metric minimize (total-cost))
)

; plan
1. (sup_activate-teleport-origin pos0-1)
   deleted: (supporter_turn) (teleport_origin_can_be_activated) (at-teleport pos0-1 disabled)
   added: (prime_turn) (at-teleport pos0-1 origin)
   goals met: 0 of 1
2. (pri_walk pos0-1 pos1-1)
   deleted: (prime_turn) (at-prime pos0-1)
   added: (supporter_turn) (at-prime pos1-1)
   goals met: 0 of 1
3. (sup_activate-teleport-destination pos2-7)
   deleted: (supporter_turn) (teleport_destination_can_be_activated) (at-teleport pos2-7 disabled)
   added: (prime_turn) (at-teleport pos2-7 destination)
   goals met: 0 of 1
4. (pri_walk pos1-1 pos2-1)
   deleted: (prime_turn) (at-prime pos1-1)
   added: (supporter_turn) (at-prime pos2-1)
   goals met: 0 of 1
5. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
6. (pri_walk pos2-1 pos2-2)
   deleted: (prime_turn) (at-prime pos2-1)
   added: (supporter_turn) (at-prime pos2-2)
   goals met: 0 of 1
7. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
8. (pri_walk pos2-2 pos2-3)
   deleted: (prime_turn) (at-prime pos2-2)
   added: (supporter_turn) (at-prime pos2-3)
   goals met: 0 of 1
9. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
10. (pri_walk pos2-3 pos1-3)
   deleted: (prime_turn) (at-prime pos2-3)
   added: (supporter_turn) (at-prime pos1-3)
   goals met: 0 of 1
11. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
12. (pri_walk pos1-3 pos1-4)
   deleted: (prime_turn) (at-prime pos1-3)
   added: (supporter_turn) (at-prime pos1-4)
   goals met: 0 of 1
13. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
14. (pri_walk pos1-4 pos1-5)
   deleted: (prime_turn) (at-prime pos1-4)
   added: (supporter_turn) (at-prime pos1-5)
   goals met: 0 of 1
15. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
16. (pri_walk pos1-5 pos1-6)
   deleted: (prime_turn) (at-prime pos1-5)
   added: (supporter_turn) (at-prime pos1-6)
   goals met: 0 of 1
17. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
18. (pri_walk pos1-6 pos1-7)
   deleted: (prime_turn) (at-prime pos1-6)
   added: (supporter_turn) (at-prime pos1-7)
   goals met: 1 of 1
